CSI API ETABS v1
cPointObj.GetSpring Method
 Retrieves uncoupled spring stiffness assignments for a point object, that is, it retrieves the diagonal terms in the 6x6 spring matrix for the point object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSpring(
	string Name,
	ref double[] K
)
Function GetSpring (
	Name As String,
	ByRef K As Double()
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim K As Double()
Dim returnValue As Integer
returnValue = instance.GetSpring(Name,
	K)
int GetSpring(
	String^ Name,
	array<double>^% K
)
abstract GetSpring :
        Name : string *
        K : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing point object.
K
Type: System.Double[]
 This is an array of six spring stiffness values.
Value(0) = U1 [F/L]
Value(1) = U2 [F/L]
Value(2) = U3 [F/L]
Value(3) = R1 [FL/rad]
Value(4) = R2 [FL/rad]
Value(5) = R3 [FL/rad]
Return Value
Type: Int32
 Returns zero if the stiffnesses are successfully retrieved, otherwise it returns a nonzero value. If no springs exist at the point object, the function returns a nonzero value.
Remarks
 The spring stiffnesses reported are the sum of all springs assigned to the point object. The spring stiffness values are reported in the point local coordinate system.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'assign spring to a point
       ReDim k(5)
       k(2) = 10
       ret = SapModel.PointObj.SetSpring("3", k)
   'get spring values
       ReDim k(5)
       ret = SapModel.PointObj.GetSpring("3", k)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPointObj Interface
ETABSv1 Namespace